[
    {
      "title": "Supplier Generates the Invoice",
      "details": [
        "The process begins with the supplier generating the invoice for the goods or services provided to the buyer.",
        "The invoice contains relevant details such as invoice number, item description, quantity, and price."
      ]
    },
    {
      "title": "Supplier Creates ZKP & Merkle Root",
      "details": [
        "To ensure privacy and data confidentiality, the supplier creates a Zero Knowledge Proof (ZKP) and a Merkle root.",
        "The ZKP enables verification of the invoice&apos;s validity without revealing sensitive data to public blockchain.",
        "The Merkle root acts as a cryptographic proof of the invoice&apos;s integrity and inclusion in the blockchain."
      ]
    },
    {
      "title": "Supplier Links the Invoice to DID",
      "details": [
        "The supplier associates the invoice with their Decentralized Identifier (DID), a unique identifier onthe blockchain.",
        "Linking the invoice to the DID establishes a secure connection between the supplier&apos;s identity and the transaction."
      ]
    },
    {
      "title": "Supplier Creates ACDC",
      "details": [
        "The supplier creates Authentic Chained Data Containers(ACDC) to securely store and manage the invoice and related data.",
        "ACDC utilizes encryption and compartmentalization to protect sensitive information and ensure data privacy.",
        "ACDC enables secure sharing of the invoice data with authorized parties, while maintaining its confidentiality."
      ]
    },
    {
      "title": "Supplier Sends the Invoice to the Buyer",
      "details": [
        "After generating the invoice and creating the necessary proofs, the supplier sends the invoice to the buyer  (Based on configured parameters).",
        "The invoice is securely transmitted using established communication channels between the supplier and the buyer ."
      ]
    },
    {
      "title": "Buyer Verifies the Invoice",
      "details": [
        "Upon receiving the invoice, the buyer performs a verification process to ensure its authenticity and accuracy.",
        "The buyer may use various validation mechanisms, including automated data matching, digital signatures, on chain verification using the ZKPs generated by Supplier."
      ]
    },
    {
      "title": "Buyer Accepts or Rejects the Invoice",
      "details": [
        "Based on the verification results, the buyer makes a decision to either accept or reject the invoice.",
        "If the invoice meets the required criteria and passes the validation, the buyer accepts it for further processing.",
        "In case of any discrepancies or issues, the buyer may reject the invoice and initiate resolution with the supplier."
      ]
    },
    {
      "title": "Buyer Links Their (DID) to the Invoice",
      "details": [
        "Upon accepting the invoice, the buyer links their Decentralized Identifier (DID) to the invoice.",
        "Linking the buyer&apos;s DID to the invoice establishes a secure and verifiable connection between the buyer&apos;s identity and the transaction."
      ]
    },
    {
      "title": "Supplier Resolves the Rejection",
      "details": [
        "If the buyer rejects the invoice, the supplier initiates the resolution process.",
        "The supplier works with the buyer to identify and address any discrepancies or issues raised during the verification."
      ]
    },
    {
      "title": "Supplier Generates Revised Invoice (If Needed)",
      "details": [
        "If the resolution process requires modifications to the invoice, the supplier generates a revised invoice .",
        "The revised invoice incorporates the necessary changes based on the resolution discussions with the buyer."
      ]
    },
    {
      "title": "Supplier Applies for Invoice Finance",
      "details": [
        "After the acceptance of the invoice by the buyer, the supplier has the option to apply for invoice finance.",
        "Invoice finance allows the supplier to obtain funding against the value of the accepted invoice."
      ]
    },
    {
      "title": "Bank Performs Field-Level Verification",
      "details": [
        "Upon receiving the supplier&apos;s request for invoice finance, the bank performs field-level verification of the invoice.",
        "The bank utilizes advanced independent verification mechanisms, including field-level checks, merkle roots, and zero knowledge proofs, to validate the authenticity and uniqueness of the invoice."
      ]
    },
    {
      "title": "Bank Checks for Duplicate Invoice Financing",
      "details": [
        "The bank performs checks to ensure that the same invoice is not being financed by multiple lenders.",
        "Utilizing the power of blockchain and Merkle roots, the bank verifies the uniqueness of the invoice to prevent duplicate financing."
      ]
    },
    {
      "title": "Bank Verifies Invoice and ZKP",
      "details": [
        "The bank conducts a comprehensive verification process to validate the authenticity and integrity of the invoice and the ZKP.",
        "This verification step ensures that the invoice and ZKPhave not been tampered with and are valid."
      ]
    },
    {
      "title": "Bank Provides Invoice Finance",
      "details": [
        "If the verification process is successful, the bank provides invoice finance to the supplier.",
        "The finance amount is determined based on the valueof the accepted invoice."
      ]
    },
    {
      "title": "Bank Rejects Invoice Finance (If Unsuccessful)",
      "details": [
        "If the verification process uncovers any issues ordiscrepancies, the bank rejects the invoice financerequest.",
        "The supplier is notified of the rejection, and appropriatesteps can be taken to address the concerns."
      ]
    }
  ]
  